app/controllers/users_controller.rb

    def create
      @user = User.new(username: params[:username], email: params[:email], password: params[:password])
      #@user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Gus"], ["email", "ga_s@jas.com"], ["password", "asas"], ["created_at", "2021-01-22 18:13:13.772125"], ["updated_at", "2021-01-22 18:13:13.772125"]]

    def update
      @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Tadeo"], ["email", "tadeo@asas.com"], ["password", "tadeopass"], ["updated_at", "2021-01-25 15:21:04.046124"], ["id", 1]]